const FaqAuthRegister = () => {
  return (
    <>
      <h2 className="pb-8 text-lg font-semibold sm:text-xl">
        როგორ დავრეგისტრირდე?
      </h2>
      <p className="max-w-3xl text-pretty">
        Agroezo-თი სრულყოფილად სარგებლობისთვის გაიარე რეგისტრაცია. მთავარ
        გვერდზე დააჭირე ღილაკს &quot;შესვლა/რეგისტრაცია&quot; გახსნილ გვერდზე
        აირჩიე &quot;შექმენი&quot; და შეავსე ყველა სავალდებულო ველი:
        <br />
        &#8226; ელ.ფოსტა - აუცილებლად მიუთითე აქტიური ელ.ფოსტა;
        <br /> &#8226; პაროლი - პაროლი უნდა შეიცავდეს მინიმუმ 8 სიმბოლოს; <br />
        &#8226; გაიმეორე პაროლი - გაიმეორე პაროლის გრაფაში მითითებული
        კომბინაცია;
        <br />
        &#8226; მობილურის ნომერი - ამ გრაფაში ჩაწერე აქტიური ტელეფონის ნომერი;
        <br /> &#8226; გაეცანი და დაეთანხმე საიტის წესებს;
        <br /> &#8226; შემდეგ კი დააჭირე ღილაკს &quot;დადასტურება&quot;;
        <br /> &#8226; შეგიძლია, გაიარო ავტორიზაცია და ისარგებლო Agroezo-ს ყველა
        ფუნქციონალით.
      </p>
    </>
  );
};
export default FaqAuthRegister;
