const FaqAuthRecover = () => {
  return (
    <>
      <h2 className="pb-8 text-lg font-semibold sm:text-xl">
        როგორ აღვადგინო ანგარიში?
      </h2>
      <p className="max-w-3xl text-pretty">
        მთავარ გვერდზე დააჭირე ღილაკს &quot;შესვლა/რეგისტრაცია&quot; გახსნილ
        გვერდზე აირჩიე &quot;პაროლის აღდგენა&quot; და მიუთითე ელ.ფოსტა რომლითაც
        ხარ დარეგისტრირებული.
        <br />
        <br />
        &#8226; მითითებულ ელ.ფოსტაზე მიიღებთ ბმულს, რომელზე დაჭერითაც გადმოხვალთ
        ჩვენ საიტზე და შეიყვანთ ახალ პაროლს;
        <br />
        <br /> &#8226; გაიარე ავტორიზაცია არსებული ელ.ფოსტით და ახალი პაროლით;
      </p>
    </>
  );
};
export default FaqAuthRecover;
